УТ/src/Catalogs/CRM_СостоянияИнтересов/CRM_СостоянияИнтересов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_СостоянияИнтересов</name>
  <comment>Сценарии продаж</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>БлокируемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>БлокируемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВероятностьСделки</name>
    <comment>Вероятность сделки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСостояния</name>
    <type>
      <types>EnumRef.CRM_ВидыСостоянияИнтереса</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВероятностьВПредставлениеСостояния</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьЗапланированныеАктивности</name>
    <type>
      <types>EnumRef.CRM_ЗавершаемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьСвязанныеДиалоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <comment>Состояние завершения интереса</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерактивноеПланированиеАктивностей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЧекЛист</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияСостояния</name>
    <type>
      <types>EnumRef.CRM_КатегорииСостоянийПоддержки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьЗадачу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеПланированиеАктивности</name>
    <type>
      <types>EnumRef.CRM_ПланируемыеТипыАктивности</types>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемыйСрокНаЭтапе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтборЗавершаемыхАктивностей</name>
    <type>
      <types>EnumRef.CRM_ОтборыЗавершаемыхАктивностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Офис</name>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаВыполненияЧекЛиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтереса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеРеквизитыИнтересаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРолевуюАдресацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьДостигнутыйРезультат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ОбязательноеЗаполнениеКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УказаниеОжидаемойВыручки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыУслуг</name>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>CatalogRef.CRM_ТипУслуги</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТипыОбращений</name>
    <attributes>
      <name>ТипОбращения</name>
      <type>
        <types>CatalogRef.CRM_ТипыОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_СостоянияИнтересов/Forms/ФормаСквознойЧекЛист/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сценарий") И ЗначениеЗаполнено(Параметры.Сценарий) Тогда
		Сценарий = Параметры.Сценарий;
		Заголовок = НСтр("ru = 'Чек-лист'") + ": " + Сценарий.Наименование;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЧекЛистПоСценарию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если СохранитьИзмененияЧекЛиста() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	ПереместитьСтрокуЧекЛиста(-1);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	ПереместитьСтрокуЧекЛиста(1);
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьСтрокуЧекЛиста(Смещение)
	ТекСтр = Элементы.ЧекЛист.ТекущиеДанные;
	Индекс = ЧекЛист.Индекс(ТекСтр);
	НовИндекс = (Индекс + Смещение);
	Если НовИндекс >= 0 И НовИндекс < ЧекЛист.Количество() Тогда 
		Для каждого ЭлементСЗ Из СписокСостояний Цикл
			Если ТекСтр[ЭлементСЗ.Представление] Тогда
				ЭлементСЗ.Пометка = Истина;
			КонецЕсли;
		КонецЦикла;
		ЧекЛист.Сдвинуть(Индекс, Смещение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ЧекЛистОписаниеЗадачиПриИзменении(Элемент)
	ТекСтр = Элементы.ЧекЛист.ТекущиеДанные;
	Для каждого ЭлементСЗ Из СписокСостояний Цикл
		Если ТекСтр[ЭлементСЗ.Представление] Тогда
			ЭлементСЗ.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистПередУдалением(Элемент, Отказ)
	ТекСтр = Элементы.ЧекЛист.ТекущиеДанные;
	Для каждого ЭлементСЗ Из СписокСостояний Цикл
		Если ТекСтр[ЭлементСЗ.Представление] Тогда
			ЭлементСЗ.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЧекЛистКолонкаПриИзменении(Элемент)
	Для каждого ЭлементСЗ Из СписокСостояний Цикл
		Если ЭлементСЗ.Представление = Элемент.Имя Тогда
			ЭлементСЗ.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЧекЛистПоСценарию()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	CRM_СостоянияИнтересов.Ссылка КАК Состояние,
	                      |	CRM_СостоянияИнтересов.Наименование КАК Наименование,
	                      |	CRM_СостоянияИнтересовЧекЛист.ОписаниеЗадачи КАК ОписаниеЗадачи,
	                      |	CRM_СостоянияИнтересовЧекЛист.НомерСтроки КАК НомерСтроки,
	                      |	CRM_СостоянияИнтересов.РеквизитДопУпорядочивания КАК РеквизитДопУпорядочивания
	                      |ИЗ
	                      |	Справочник.CRM_СостоянияИнтересов КАК CRM_СостоянияИнтересов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_СостоянияИнтересов.ЧекЛист КАК CRM_СостоянияИнтересовЧекЛист
	                      |		ПО (CRM_СостоянияИнтересовЧекЛист.Ссылка = CRM_СостоянияИнтересов.Ссылка)
	                      |			И (CRM_СостоянияИнтересов.ИспользоватьЧекЛист)
	                      |ГДЕ
	                      |	CRM_СостоянияИнтересов.Родитель = &Сценарий
	                      |	И НЕ CRM_СостоянияИнтересов.Завершено
	                      |	И НЕ CRM_СостоянияИнтересов.ПометкаУдаления
	                      |	И CRM_СостоянияИнтересов.Используется
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	РеквизитДопУпорядочивания,
	                      |	НомерСтроки
	                      |ИТОГИ
	                      |	МАКСИМУМ(Наименование)
	                      |ПО
	                      |	Состояние,
	                      |	ОписаниеЗадачи");
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаСостояние = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	нРеквизиты = Новый Массив;
	Пока ВыборкаСостояние.Следующий() Цикл
		ИмяКолонки = "Колонка" + СтрЗаменить(Строка(ВыборкаСостояние.Состояние.УникальныйИдентификатор()), "-", "_");
		нРеквизиты.Добавить(Новый РеквизитФормы(ИмяКолонки, Новый ОписаниеТипов("Булево"), "ЧекЛист",
			 ВыборкаСостояние.Наименование,
			 Истина));
		СписокСостояний.Добавить(ВыборкаСостояние.Состояние, ИмяКолонки);
	КонецЦикла;
	ИзменитьРеквизиты(нРеквизиты);
	
	Для каждого ЭлементСЗ Из СписокСостояний Цикл
		нЭлемент = Элементы.Добавить(ЭлементСЗ.Представление, Тип("ПолеФормы"), Элементы.ЧекЛист); 
		нЭлемент.Вид = ВидПоляФормы.ПолеФлажка; 
		нЭлемент.ПутьКДанным = "ЧекЛист." + ЭлементСЗ.Представление;
		нЭлемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		нЭлемент.УстановитьДействие("ПриИзменении", "ЧекЛистКолонкаПриИзменении"); 
	КонецЦикла;

	ВыборкаОписание = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОписаниеЗадачи");
	Пока ВыборкаОписание.Следующий() Цикл
		Если ВыборкаОписание.ОписаниеЗадачи = null Тогда
			Продолжить;
		КонецЕсли;
		НовСтр = ЧекЛист.Добавить();
		НовСтр.ОписаниеЗадачи = ВыборкаОписание.ОписаниеЗадачи;
		Выборка = ВыборкаОписание.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Состояние");
		Пока Выборка.Следующий() Цикл
			ЭлементСЗ = СписокСостояний.НайтиПоЗначению(Выборка.Состояние);
			Если ЭлементСЗ <> Неопределено Тогда
				НовСтр[ЭлементСЗ.Представление] = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция СохранитьИзмененияЧекЛиста()
	
	НачатьТранзакцию();
	Попытка
		Для каждого ЭлементСЗ Из СписокСостояний Цикл
			Если ЭлементСЗ.Пометка Тогда
				СпрОбъект = ЭлементСЗ.Значение.ПолучитьОбъект();
				СпрОбъект.ЧекЛист.Очистить();
				Для каждого Стр Из ЧекЛист Цикл
					Если Стр[ЭлементСЗ.Представление] Тогда
						НовСтр = СпрОбъект.ЧекЛист.Добавить();
						НовСтр.ОписаниеЗадачи = Стр.ОписаниеЗадачи;
					КонецЕсли;
				КонецЦикла;
				СпрОбъект.ИспользоватьЧекЛист = (СпрОбъект.ЧекЛист.Количество() > 0);
				СпрОбъект.Записать();
			КонецЕсли;
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
		
КонецФункции

#КонецОбласти
